
&НаКлиенте
Процедура ПечатьДокумента(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьДок(ТабДок);
	Если ТабДок<>Неопределено Тогда
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 
		ТабДок.АвтоМасштаб = Истина;
		ТабДок.Показать();
		//УниверсальныеМеханизмы.НапечататьДокумент(ТабДок);

	КонецЕсли;

КонецПроцедуры

Функция ПечатьДок(ТабДок) 
	
	ОбъектыПечати = Новый СписокЗначений;	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.СсылкаНаОбъект);
	
	//        
	//НастройкиПечати = УчетНДСВызовСервера.ПолучитьНастройкиПечатиСчетовФактур(МассивОбъектов);
	//
	//СчетаФактуры = НастройкиПечати.СчетаФактуры;
	//
	
	ТабДок = РеквизитФормыВЗначение("Объект").ПечатьБланкДоговора(МассивОбъектов);
                       
	Возврат ТабДок;

КонецФункции

//Функция ТекстЗапросаПечатьСчетовФактур(ИспользуетсяПостановлениеНДС1137 = Истина, ДляУниверсальногоПередаточногоДокумента = Ложь, ИспользуетсяПостановлениеНДС981 = Неопределено) Экспорт

//	ТекстЗапроса = 
//	"ВЫБРАТЬ
//	|	СчетФактура.Ссылка КАК СчетФактура,
//	|	ВЫБОР
//	|		КОГДА СчетФактура.Исправление
//	|			ТОГДА СчетФактура.ДатаИсходногоДокумента
//	|		ИНАЧЕ СчетФактура.Дата
//	|	КОНЕЦ КАК Дата,
//	|	ВЫБОР
//	|		КОГДА СчетФактура.Исправление
//	|			ТОГДА СчетФактура.НомерИсходногоДокумента
//	|		ИНАЧЕ СчетФактура.Номер
//	|	КОНЕЦ КАК Номер,
//	|	СчетФактура.ВидСчетаФактуры КАК ВидСчетаФактуры,
//	|	СчетФактура.Руководитель КАК Руководитель,
//	|	СчетФактура.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
//	|	СчетФактура.СчетФактураБезНДС КАК СчетФактураБезНДС,
//	|	СчетФактура.Исправление КАК Исправление,
//	|	СчетФактура.НомерИсправления КАК НомерИсправления,
//	|	СчетФактура.Дата КАК ДатаИсправления,
//	|	СчетФактура.Дата КАК ДатаСведений,
//	|	НЕ СчетФактура.Исправление КАК УдалитьПрефиксыИзНомера,
//	|	ИСТИНА КАК ЭтоСчетФактураВыданный,
//	|	ИСТИНА КАК ВыводитьСуммуБезНДС,
//	|	СчетФактураДокументыОснования.ДокументОснование КАК ДокументОснование,
//	|	СчетФактураДокументыОснования.НомерСтроки КАК НомерСтроки,
//	|	ВЫБОР
//	|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА СчетФактура.Продавец
//	|		ИНАЧЕ СчетФактура.Контрагент
//	|	КОНЕЦ КАК Контрагент,
//	|	ВЫБОР
//	|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|			ТОГДА НЕОПРЕДЕЛЕНО
//	|		ИНАЧЕ СчетФактура.ДоговорКонтрагента
//	|	КОНЕЦ КАК ДоговорКонтрагента,
//	|	СчетФактура.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
//	|	СчетФактура.КППКонтрагента КАК КППСчетаФактуры,
//	|	СчетФактура.Организация КАК Организация,
//	|	ВЫБОР
//	|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
//	|	КОНЕЦ КАК ВидДоговора,
//	|	СчетФактура.Организация.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
//	|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения КАК ЦифровойИндексОбособленногоПодразделения,
//	|	ЛОЖЬ КАК НеподтверждениеНулевойСтавки,
//	|	СчетФактура.СводныйКомиссионный КАК СводныйКомиссионный,
//	|	ЕСТЬNULL(СчетФактура.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ) КАК СчетаФактурыОтИмениОрганизации
//	|ИЗ
//	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураДокументыОснования
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
//	|		ПО СчетФактураДокументыОснования.Ссылка = СчетФактура.Ссылка
//	|ГДЕ
//	|	СчетФактураДокументыОснования.Ссылка В(&МассивОбъектов)
//	|	И &УсловиеПоДате
//	|	И СчетФактура.ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
//	|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ПодтверждениеНулевойСтавкиНДС)";
//	
//	Если ДляУниверсальногоПередаточногоДокумента Тогда
//		ТекстЗапроса = ТекстЗапроса + "
//		|	И СчетФактура.Дата >= ДАТАВРЕМЯ(2013, 1, 1)
//		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ОтчетКомиссионераОПродажах)
//		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ОтражениеНачисленияНДС)
//		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.НачислениеНДСпоСМРхозспособом)";
//	КонецЕсли;
//	
//	// СФ на аванс
//	ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "", " ОБЪЕДИНИТЬ ВСЕ ") +
//	"ВЫБРАТЬ
//	|	СчетФактура.Ссылка КАК СчетФактура,
//	|	ВЫБОР
//	|		КОГДА СчетФактура.Исправление
//	|			ТОГДА СчетФактура.ДатаИсходногоДокумента
//	|		ИНАЧЕ СчетФактура.Дата
//	|	КОНЕЦ КАК Дата,
//	|	ВЫБОР
//	|		КОГДА СчетФактура.Исправление
//	|			ТОГДА СчетФактура.НомерИсходногоДокумента
//	|		ИНАЧЕ СчетФактура.Номер
//	|	КОНЕЦ КАК Номер,
//	|	СчетФактура.ВидСчетаФактуры,
//	|	СчетФактура.Руководитель,
//	|	СчетФактура.ГлавныйБухгалтер,
//	|	ЛОЖЬ КАК СчетФактураБезНДС,
//	|	СчетФактура.Исправление,
//	|	СчетФактура.НомерИсправления,
//	|	СчетФактура.Дата КАК ДатаИсправления,
//	|	СчетФактура.Дата КАК ДатаСведений,
//	|	НЕ СчетФактура.Исправление КАК УдалитьПрефиксыИзНомера,
//	|	ИСТИНА КАК ЭтоСчетФактураВыданный,
//	|	ЛОЖЬ КАК ВыводитьСуммуБезНДС,
//	|	СчетФактура.Ссылка КАК ДокументОснование,
//	|	1 КАК НомерСтроки,
//	|	ВЫБОР
//	|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
//	|				И СчетФактура.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
//	|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
//	|		ИНАЧЕ СчетФактура.Контрагент
//	|	КОНЕЦ КАК Контрагент,
//	|	СчетФактура.ДоговорКонтрагента,
//	|	СчетФактура.ИдентификаторГосКонтракта,
//	|	СчетФактура.КППКонтрагента КАК КППСчетаФактуры,
//	|	СчетФактура.Организация,
//	|	ВЫБОР
//	|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
//	|	КОНЕЦ КАК ВидДоговора,
//	|	СчетФактура.Организация.ОбособленноеПодразделение,
//	|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
//	|	ЛОЖЬ КАК НеподтверждениеНулевойСтавки,
//	|	СчетФактура.СводныйКомиссионный КАК СводныйКомиссионный,
//	|	ЕСТЬNULL(СчетФактура.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ) КАК СчетаФактурыОтИмениОрганизации
//	|ИЗ
//	|	Документ.СчетФактураВыданный КАК СчетФактура
//	|ГДЕ
//	|	СчетФактура.Ссылка В(&МассивОбъектов)
//	|	И &УсловиеПоДате
//	|	И СчетФактура.ВидСчетаФактуры В (ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))";
//	
//	Если НЕ ДляУниверсальногоПередаточногоДокумента Тогда
//		
//		ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "", " ОБЪЕДИНИТЬ ВСЕ ") +
//		"ВЫБРАТЬ
//		|	СчетФактура.Ссылка,
//		|	СчетФактура.Дата,
//		|	СчетФактура.Номер,
//		|	СчетФактура.ВидСчетаФактуры,
//		|	СчетФактура.Руководитель,
//		|	СчетФактура.ГлавныйБухгалтер,
//		|	ЛОЖЬ,
//		|	СчетФактура.Исправление,
//		|	СчетФактура.НомерИсправления,
//		|	СчетФактура.Дата,
//		|	СчетФактура.Дата,
//		|	ИСТИНА,
//		|	ИСТИНА,
//		|	ЛОЖЬ,
//		|	СчетФактура.Ссылка,
//		|	1,
//		|	ВЫБОР
//		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
//		|				И СчетФактура.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
//		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
//		|		ИНАЧЕ СчетФактура.Контрагент
//		|	КОНЕЦ,
//		|	СчетФактура.ДоговорКонтрагента,
//		|	"""",
//		|	СчетФактура.КППКонтрагента,
//		|	СчетФактура.Организация,
//		|	ВЫБОР
//		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
//		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
//		|	КОНЕЦ,
//		|	СчетФактура.Организация.ОбособленноеПодразделение,
//		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
//		|	ЛОЖЬ,
//		|	СчетФактура.СводныйКомиссионный,
//		|	ЕСТЬNULL(СчетФактура.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ)
//		|ИЗ
//		|	Документ.СчетФактураВыданный КАК СчетФактура
//		|ГДЕ
//		|	СчетФактура.Ссылка В(&МассивОбъектов)
//		|	И &УсловиеПоДате
//		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу)
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	СчетФактура.Ссылка,
//		|	ВЫБОР
//		|		КОГДА СчетФактура.Исправление
//		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
//		|		ИНАЧЕ СчетФактура.Дата
//		|	КОНЕЦ,
//		|	ВЫБОР
//		|		КОГДА СчетФактура.Исправление
//		|			ТОГДА СчетФактура.НомерИсходногоДокумента
//		|		ИНАЧЕ СчетФактура.Номер
//		|	КОНЕЦ,
//		|	СчетФактура.ВидСчетаФактуры,
//		|	СчетФактура.Руководитель,
//		|	СчетФактура.ГлавныйБухгалтер,
//		|	СчетФактура.СчетФактураБезНДС,
//		|	СчетФактура.Исправление,
//		|	СчетФактура.НомерИсправления,
//		|	СчетФактура.Дата,
//		|	СчетФактура.Дата,
//		|	НЕ СчетФактура.Исправление,
//		|	ИСТИНА,
//		|	ИСТИНА,
//		|	СчетФактура.Ссылка,
//		|	1,
//		|	ВЫБОР
//		|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
//		|				И СчетФактура.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
//		|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
//		|		ИНАЧЕ СчетФактура.Контрагент
//		|	КОНЕЦ,
//		|	СчетФактура.ДоговорКонтрагента,
//		|	"""",
//		|	СчетФактура.КППКонтрагента,
//		|	СчетФактура.Организация,
//		|	ВЫБОР
//		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
//		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
//		|	КОНЕЦ,
//		|	СчетФактура.Организация.ОбособленноеПодразделение,
//		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
//		|	ЛОЖЬ,
//		|	СчетФактура.СводныйКомиссионный,
//		|	ЕСТЬNULL(СчетФактура.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ)
//		|ИЗ
//		|	Документ.СчетФактураВыданный КАК СчетФактура
//		|ГДЕ
//		|	СчетФактура.Ссылка В(&МассивОбъектов)
//		|	И &УсловиеПоДате
//		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	СчетФактура.Ссылка,
//		|	ВЫБОР
//		|		КОГДА СчетФактура.Исправление
//		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
//		|		ИНАЧЕ СчетФактура.Дата
//		|	КОНЕЦ,
//		|	ВЫБОР
//		|		КОГДА СчетФактура.Исправление
//		|			ТОГДА СчетФактура.НомерИсходногоДокумента
//		|		ИНАЧЕ СчетФактура.Номер
//		|	КОНЕЦ,
//		|	СчетФактура.ВидСчетаФактуры,
//		|	СчетФактура.Руководитель,
//		|	СчетФактура.ГлавныйБухгалтер,
//		|	СчетФактура.СчетФактураБезНДС,
//		|	СчетФактура.Исправление,
//		|	СчетФактура.НомерИсправления,
//		|	СчетФактура.Дата,
//		|	СчетФактура.Дата,
//		|	НЕ СчетФактура.Исправление,
//		|	ИСТИНА,
//		|	ИСТИНА,
//		|	ПодтверждениеНулевойСтавкиСостав.ДокументОтгрузки,
//		|	ПодтверждениеНулевойСтавкиСостав.НомерСтроки,
//		|	ВЫБОР
//		|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//		|			ТОГДА СчетФактура.Продавец
//		|		ИНАЧЕ СчетФактура.Контрагент
//		|	КОНЕЦ,
//		|	ВЫБОР
//		|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//		|			ТОГДА НЕОПРЕДЕЛЕНО
//		|		ИНАЧЕ СчетФактура.ДоговорКонтрагента
//		|	КОНЕЦ,
//		|	СчетФактура.ИдентификаторГосКонтракта,
//		|	СчетФактура.КППКонтрагента,
//		|	СчетФактура.Организация,
//		|	ВЫБОР
//		|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//		|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
//		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
//		|	КОНЕЦ,
//		|	СчетФактура.Организация.ОбособленноеПодразделение,
//		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
//		|	ИСТИНА,
//		|	СчетФактура.СводныйКомиссионный,
//		|	ЕСТЬNULL(СчетФактура.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ)
//		|ИЗ
//		|	Документ.СчетФактураВыданный КАК СчетФактура
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиСостав
//		|		ПО (ПодтверждениеНулевойСтавкиСостав.СчетФактураВыданный = СчетФактура.Ссылка)
//		|ГДЕ
//		|	СчетФактура.Ссылка В(&МассивОбъектов)
//		|	И &УсловиеПоДате
//		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
//		|	И ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.ПодтверждениеНулевойСтавкиНДС)
//		|	И ТИПЗНАЧЕНИЯ(ПодтверждениеНулевойСтавкиСостав.ДокументОтгрузки) <> ТИП(Документ.СчетФактураВыданный)
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	СчетФактураПоСтавке0.Ссылка,
//		|	ВЫБОР
//		|		КОГДА СчетФактура.Исправление
//		|			ТОГДА СчетФактура.ДатаИсходногоДокумента
//		|		ИНАЧЕ СчетФактура.Дата
//		|	КОНЕЦ,
//		|	ВЫБОР
//		|		КОГДА СчетФактура.Исправление
//		|			ТОГДА СчетФактура.НомерИсходногоДокумента
//		|		ИНАЧЕ СчетФактура.Номер
//		|	КОНЕЦ,
//		|	СчетФактура.ВидСчетаФактуры,
//		|	СчетФактура.Руководитель,
//		|	СчетФактура.ГлавныйБухгалтер,
//		|	СчетФактура.СчетФактураБезНДС,
//		|	СчетФактура.Исправление,
//		|	СчетФактура.НомерИсправления,
//		|	СчетФактура.Дата,
//		|	СчетФактура.Дата,
//		|	НЕ СчетФактура.Исправление,
//		|	ИСТИНА,
//		|	ИСТИНА,
//		|	СчетФактураПоСтавке0.ДокументОснование,
//		|	ПодтверждениеНулевойСтавкиСостав.НомерСтроки,
//		|	ВЫБОР
//		|		КОГДА СчетФактураПоСтавке0.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//		|			ТОГДА СчетФактураПоСтавке0.Продавец
//		|		ИНАЧЕ СчетФактураПоСтавке0.Контрагент
//		|	КОНЕЦ,
//		|	ВЫБОР
//		|		КОГДА СчетФактураПоСтавке0.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//		|			ТОГДА НЕОПРЕДЕЛЕНО
//		|		ИНАЧЕ СчетФактураПоСтавке0.ДоговорКонтрагента
//		|	КОНЕЦ,
//		|	СчетФактура.ИдентификаторГосКонтракта,
//		|	СчетФактура.КППКонтрагента,
//		|	СчетФактура.Организация,
//		|	ВЫБОР
//		|		КОГДА СчетФактураПоСтавке0.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//		|			ТОГДА СчетФактураПоСтавке0.ДоговорКонтрагента.ВидДоговора
//		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
//		|	КОНЕЦ,
//		|	СчетФактура.Организация.ОбособленноеПодразделение,
//		|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
//		|	ИСТИНА,
//		|	СчетФактура.СводныйКомиссионный,
//		|	ЕСТЬNULL(СчетФактура.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ)
//		|ИЗ
//		|	Документ.СчетФактураВыданный КАК СчетФактура
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиСостав
//		|		ПО (ПодтверждениеНулевойСтавкиСостав.СчетФактураВыданный = СчетФактура.Ссылка)
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураПоСтавке0
//		|		ПО (ПодтверждениеНулевойСтавкиСостав.ДокументОтгрузки = СчетФактураПоСтавке0.Ссылка)
//		|ГДЕ
//		|	СчетФактура.Ссылка В(&МассивОбъектов)
//		|	И &УсловиеПоДате
//		|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
//		|	И ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.ПодтверждениеНулевойСтавкиНДС)
//		|	И ТИПЗНАЧЕНИЯ(ПодтверждениеНулевойСтавкиСостав.ДокументОтгрузки) = ТИП(Документ.СчетФактураВыданный)";
//		
//	КонецЕсли;
//	
//	ТекстЗапроса = ТекстЗапроса + "
//	|УПОРЯДОЧИТЬ ПО
//	|	Дата,
//	|	СчетФактура,
//	|	НомерСтроки
//	|ИТОГИ
//	|	МАКСИМУМ(Дата),
//	|	МАКСИМУМ(Номер),
//	|	МАКСИМУМ(ВидСчетаФактуры),
//	|	МАКСИМУМ(СчетФактураБезНДС),
//	|	МАКСИМУМ(Исправление),
//	|	МАКСИМУМ(НомерИсправления),
//	|	МАКСИМУМ(ДатаИсправления),
//	|	МАКСИМУМ(УдалитьПрефиксыИзНомера),
//	|	МАКСИМУМ(ЭтоСчетФактураВыданный),
//	|	МАКСИМУМ(ВыводитьСуммуБезНДС),
//	|	МАКСИМУМ(НеподтверждениеНулевойСтавки)
//	|ПО
//	|	СчетФактура" + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
//	
//	ТекстЗапроса = ТекстЗапроса + 
//	"ВЫБРАТЬ
//	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка КАК СчетФактура,
//	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерСтроки КАК НомерСтроки,
//	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаДокумента КАК ДатаДокумента,
//	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерДокумента КАК НомерДокумента,
//	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент
//	|ИЗ
//	|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
//	|ГДЕ
//	|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
//	|	И НЕ(СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
//	|				ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента)
//	|				ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	СчетФактураВыданныйАвансы.Ссылка,
//	|	СчетФактураВыданныйАвансы.НомерСтроки,
//	|	СчетФактураВыданныйАвансы.ДатаПлатежноРасчетногоДокумента,
//	|	СчетФактураВыданныйАвансы.НомерПлатежноРасчетногоДокумента,
//	|	СчетФактураВыданныйАвансы.Контрагент
//	|ИЗ
//	|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
//	|ГДЕ
//	|	СчетФактураВыданныйАвансы.Ссылка В(&МассивОбъектов)
//	|	И СчетФактураВыданныйАвансы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
//	|	И СчетФактураВыданныйАвансы.Ссылка.СводныйКомиссионный";
//	
//	Если ДляУниверсальногоПередаточногоДокумента Тогда
//		
//		ТекстЗапроса = ТекстЗапроса + "
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	СчетФактураВыданный.Ссылка,
//		|	1,
//		|	СчетФактураВыданный.ДатаПлатежноРасчетногоДокумента,
//		|	СчетФактураВыданный.НомерПлатежноРасчетногоДокумента,
//		|	СчетФактураВыданный.Контрагент
//		|ИЗ
//		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
//		|ГДЕ
//		|	СчетФактураВыданный.Ссылка В(&МассивОбъектов)
//		|	И СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)";
//		
//	Иначе
//		
//		ТекстЗапроса = ТекстЗапроса + "
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|" + 
//		"ВЫБРАТЬ
//		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка,
//		|	1,
//		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаПлатежноРасчетногоДокумента,
//		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерПлатежноРасчетногоДокумента,
//		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//		|ИЗ
//		|	Документ.СчетФактураВыданный КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
//		|ГДЕ
//		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
//		|	И (СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
//		|			ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента)
//		|			ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
//		|				И НЕ СчетФактураВыданныйПлатежноРасчетныеДокументы.СводныйКомиссионный)
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка,
//		|	2,
//		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаДокументаАвансаКомитента,
//		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерДокументаАвансаКомитента,
//		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//		|ИЗ
//		|	Документ.СчетФактураВыданный КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
//		|ГДЕ
//		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
//		|	И СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)";

//		
//	КонецЕсли;
//	
//	ТекстЗапроса = ТекстЗапроса + "
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	НомерСтроки";
//	
//	Если ИспользуетсяПостановлениеНДС1137 Тогда
//		
//		Если ИспользуетсяПостановлениеНДС981 = Неопределено Тогда 
//			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
//				"СчетФактура.Дата >= &НачалоПримененияПостановления1137");
//			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПлатежноРасчетныеДокументыУсловиеПоДате",
//				"СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.Дата >= &НачалоПримененияПостановления1137");
//		ИначеЕсли ИспользуетсяПостановлениеНДС981 Тогда 
//			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
//				"СчетФактура.Дата >= ДАТАВРЕМЯ(2017,10,1)");
//			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПлатежноРасчетныеДокументыУсловиеПоДате",
//				"СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.Дата >= ДАТАВРЕМЯ(2017,10,1)");
//		Иначе
//			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
//				"СчетФактура.Дата МЕЖДУ &НачалоПримененияПостановления1137 И ДАТАВРЕМЯ(2017,09,30,23,59,59)");
//			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПлатежноРасчетныеДокументыУсловиеПоДате",
//				"СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.Дата МЕЖДУ &НачалоПримененияПостановления1137 И ДАТАВРЕМЯ(2017,09,30,23,59,59)");
//		КонецЕсли;
//		
//	Иначе
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
//			"СчетФактура.Дата < &НачалоПримененияПостановления1137");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПлатежноРасчетныеДокументыУсловиеПоДате",
//			"СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.Дата < &НачалоПримененияПостановления1137");
//	КонецЕсли;
//	
//	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
//	
//КонецФункции

