 //Возвращает сведения о внешней обработке.
 Функция СведенияОВнешнейОбработке() Экспорт
	 
	 ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("1.0");
	 
	 ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	 ПараметрыРегистрации.Версия = "1.0.0.1";
	 ПараметрыРегистрации.ВерсияБСП = "2.2.2.0";
	 ПараметрыРегистрации.БезопасныйРежим = Ложь;
	 ПараметрыРегистрации.Назначение.Добавить("Справочник.ДоговорыКонтрагентов");
	 
	 НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	 НоваяКоманда.Представление = ЭтотОбъект.Метаданные().Синоним;
	 НоваяКоманда.Идентификатор = ЭтотОбъект.Метаданные().Синоним;
	 НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	 НоваяКоманда.ПоказыватьОповещение = Истина;
	 НоваяКоманда.Модификатор = "ПечатьMXL";
	 
	 
	 Возврат ПараметрыРегистрации;
	 
 КонецФункции
 
 //Интерфейс для выполнения команд обработки.
 Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	 	 
	 УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,ЭтотОбъект.Метаданные().Синоним, ЭтотОбъект.Метаданные(),ПечатьБланкДоговора(МассивОбъектов));
	  
 КонецПроцедуры
 
 
 функция ПечатьБланкДоговора(МассивОбъектов) Экспорт
	 
	 ТабДокумент = Новый ТабличныйДокумент;
	 ТабДокумент.АвтоМасштаб = Истина;
	 ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	 ТабДокумент.ЭкземпляровНаСтранице = 1;
	 
	 ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_БЛАНК_ДОГОВОР_УК_ТСЖ";
	 
	 //СтруктураУчетнойПолитики = ОрганизацииФормыВызовСервера.ПараметрыСистемыНалогообложенияПоОрганизации(МассивОбъектов[0].Организация);	 
	 
	 
	 Возврат ТабДокумент;
	     
 КонецФункции	
 //Склонение Должности
 Функция ПадежП(Знач z1,Знач z2,z3=0) 
  z1=СокрЛП(z1);z4=Найти(z1+" "," ")+1;z5=Лев(z1,z4-2);z6=Прав(z5,2);
  z7=?((Найти("ая ий ый",z6)>0)и(Найти("ющий нный",Сред(z1,z4-5,4))=0)и(z3=0),"1","*");
Возврат НРег(?((z6="ая")или(Прав(z6,1)="а"),ПадежС(z5,z2,z7,1)+" "+ПадежС(Сред(z1,z4),z2),ПадежС(z5,z2,"ч",1)+?((z6="ий")и(Найти(z1," ")=0),""," "+?(z7="1",ПадежП(Сред(z1,z4),z2,Число(z7)),Сред(z1,z4)))));
КонецФункции

Функция ПадежС(z1,Знач z2=2,Знач z3="*",z4=0) 
  z5=Найти(z1,"-");
  z6=?(z5=0,"","-"+ПадежС(Сред(z1,z5+1,СтрДлина(z1)-z5+1),z2,z3,z4));
  z1=НРег(?(z5=0,z1,Лев(z1,z5-1)));
  z7=Прав(z1,3);z8=Прав(z7,2);z9=Прав(z8,1);
  z5=СтрДлина(z1);
  za=Найти("ая ия ел ок яц ий па да ца ша ба та га ка",z8);
  zb=Найти("аеёийоуэюяжнгхкчшщ",Лев(z7,1));
  zc=Макс(z2,-z2);
  zd=?(za=4,5,Найти("айяь",z9));
  zd=?((zc=1)или(z9=".")или((z4=2)и(Найти("оиеу"+?(z3="ч","","бвгджзклмнпрстфхцчшщъ"),z9)>0))или((z4=1)и(Найти("мия мяэ лия кия жая лея",z7)>0)),9,?((zd=4)и(z3="ч"),2,?(z4=1,?(Найти("оеиую",z9)+Найти("их ых аа еа ёа иа оа уа ыа эа юа яа",z8)>0,9,?(z3<>"ч",?(za=1,7,?(z9="а",?(za>18,1,6),9)),?(((Найти("ой ый",z8)>0)и(z5>4)и(Прав(z1,4)<>"опой"))или((zb>10)и(za=16)),8,zd))),zd)));
  ze=Найти("лец вей бей дец пец мец нец рец вец аец иец ыец бер",z7);
  zf=?((zd=8)и(zc<>5),?((zb>15)или(Найти("жий ний",z7)>0),"е","о"),?(z1="лев","ьв",?((Найти("аеёийоуэюя",Сред(z1,z5-3 ,1))=0)и((zb>11)или(zb=0))и(ze<>45),"",?(za=7,"л",?(za=10,"к",?(za=13,"йц",?(ze=0,"",?(ze<12,"ь"+?(ze=1,"ц",""),?(ze<37,"ц",?(ze<49,"йц","р"))))))))));
  zf=?((zd=9)или((z4=3)и(z3="ы")),z1,Лев(z1,z5-?((zd>6)или(zf<>""),2,?(zd>0,1,0)))+zf+СокрП(Сред("а у а "+Сред("оыые",Найти("внч",z9)+1,1)+"ме "+?(Найти("гжкхш",Лев(z8,1))>0,"и","ы")+" е у ойе я ю я ем"+?(za=16,"и","е")+" и е ю ейе и и ь ьюи и и ю ейи ойойу ойойойойуюойойгомуго"+?((zf="е")или(za=16)или((zb>12)и(zb<16)),"и","ы")+"мм",10*zd+2*zc-3,2)));
Возврат ?(""=z1,"",?(z4>0,ВРег(Лев(zf,1))+?((z2<0)и(z4>1),".",Сред(zf,2)),zf)+z6);
КонецФункции
